<a href="https://colab.research.google.com/github/k-ardliyan/learn-data-science/blob/master/Tugas_Hari_4_Pekan_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1>Soal 1: Pemahaman</h1>

1. Sebutkan apa saja yang termasuk preprocessing data!
2. Jelaskan beberapa cara imputing missing value!
3. Kapan kita perlu melakukan feature centering dan scaling?
4. Bagaimana Data Science Workflow?

Jawab:

1. Preprocessing data terbagi menjadi 3 bagian, yaitu encoding categorical data, imputing missing value, dan feature centering and scaling.
2. Terdapat 5 cara imputing missing value, yaitu :
  * Drop missing value, jika terdapat banyak missing value
  * Mengisi dengan Median/Mean, jika data yang missing adalah numerikal
  * Mengisi dengan Modus, jika data yang missing adalah data kategorikal
  * Mengisi dengan ffill atau bfill
  * KNN
3. Feature centering dan scaling dilakukan jika data pada kolom-kolom yang terdapat pada tabel memiliki skala yang jauh berbeda sehingga salah satu kolom dapat memiliki bobot yang sangat signifikan dibandingkan dengan kolom lainnya. Feature centering dan scaling ditujukan agar setiap kolom memiliki bobot yang sama jika dijadikan sebagai data latih atau data validasi dalam machine learning.
4. Data science workflow secara garis besar dapat dibagi menjadi tahapan :
  * Mengambil data dari source data untuk digunakan
  * Melakukan processing (manipulasi, cleaning, aggregasi, transformasi) terhadap data yang akan digunakan
  * Melakukan visualisasi data, baik untuk keperluan EDA atau membuat laporan
  * Membuat model machine learning dan melakukan evaluasi sampai model siap di-deploy
  * Men-deploy model yang telah siap
  * Melakukan monitoring terhadap model yang telah di-deploy

---

<h1>Soal 2: Pengaplikasian</h1>

Selamat, sampai tahap ini kalian telah belajar banyak tentang data science, dari mulai python, data manipulasi, visualisasi, dan pembuatan model. Sekarang saatnya untuk mengaplikasikan semuanya.

Download dan gunakan data [titanic.csv](https://drive.google.com/uc?export=download&id=15-XQkmqj2UlFQH7rASJH1oxWST6o9mbm) sebagai data untuk pembuatan model ML. Pahami betul data ini dengan melakukan EDA (Explolatory Data Analaysis), Visualisasi, Data Analysis, Preprocessing Data, dan Modeling.

<b>(Optional)</b> Download dan gunakan data [titanic_test.csv](https://drive.google.com/uc?export=download&id=15-XQkmqj2UlFQH7rASJH1oxWST6o9mbm) untuk mengetest model kalian dengan melakukan prediksi terhadap data tersebut. Submit hasil prediksinya ke kaggle dan lihat scorenya. https://www.kaggle.com/c/titanic/submit

![alt text](https://drive.google.com/uc?id=1SyflO2YeuCdYhxwPF6CAtMeaNN1qTaFx)

In [1]:
# Code here
# Import library yang dibutuhkan
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# Memuat dan menampilkan data dari datasheet
df = pd.read_csv('/content/titanic.csv')
df_test = pd.read_csv('/content/titanic_test.csv')
full_data = [df, df_test]
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [3]:
# Melihat detail mengenai data
display(df.info())
display(df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

None

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]


Melakukan feature engineering

In [4]:
# Memeriksa kolom Pclass, apakah ada data yang perlu diperbaiki (tidak ada nilai null)
print (df[['Pclass', 'Survived']].groupby(['Pclass'], as_index=False).mean())

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [5]:
# Memeriksa kolom sex, apakah ada data yang perlu diperbaiki (Tidak ada nilai null)
print (df[["Sex", "Survived"]].groupby(['Sex'], as_index=False).mean())

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [6]:
# Membuat kolom family size untuk mengetahui jumlah anggota keluarga
for i in full_data:
    i['FamilySize'] = i['SibSp'] + i['Parch'] + 1
print (df[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index=False).mean())

   FamilySize  Survived
0           1  0.303538
1           2  0.552795
2           3  0.578431
3           4  0.724138
4           5  0.200000
5           6  0.136364
6           7  0.333333
7           8  0.000000
8          11  0.000000

In [7]:
# Mengkategorikan apakah penumpang sendiri di dalam kapal menggunakan kolom family size
for i in full_data:
    i['IsAlone'] = 0
    i.loc[i['FamilySize'] == 1, 'IsAlone'] = 1
print (df[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index=False).mean())

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [8]:
# Melihat modus pada kolom Embarked
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [9]:
# Mengisi data pada kolom Embarked dengan modus dari kolom (S)
for i in full_data:
    i['Embarked'] = i['Embarked'].fillna('S')
print (df[['Embarked', 'Survived']].groupby(['Embarked'], as_index=False).mean())

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [10]:
# Membagi menjadi 4 kategori dengan qcut
df['CategoricalFare'] = pd.cut(df['Fare'], 4)
print (df[['CategoricalFare', 'Survived']].groupby(['CategoricalFare'], as_index=False).mean())

      CategoricalFare  Survived
0   (-0.512, 128.082]  0.368113
1  (128.082, 256.165]  0.724138
2  (256.165, 384.247]  0.666667
3  (384.247, 512.329]  1.000000

In [11]:
"""Untuk kolom Age, data yang hilang diisi dengan angka acak antara (mean - std) atau (mean + std),
lalu data dikategorikan menjadi 5 kategori"""
for i in full_data:
  # Mencari mean, std, dan berapa banyak kolom bernilai null
  age_avg 	   = i['Age'].mean()
  age_std 	   = i['Age'].std()
  age_null_count = i['Age'].isnull().sum()
  
  # Membuat random generator (mean - std) atau (mean + std) untuk mengisi kolom bernilai null
  age_null_random_list = np.random.randint(age_avg - age_std, age_avg + age_std, size=age_null_count)
  # Mengisi kolom kosong dengan random generator
  i['Age'][np.isnan(i['Age'])] = age_null_random_list
  # Mengubah kolom age menjadi tipe data integer
  i['Age'] = i['Age'].astype(int)

# Mengkategorikan data menjadi 5 kategori    
df['CategoricalAge'] = pd.cut(df['Age'], 5)
print (df[['CategoricalAge', 'Survived']].groupby(['CategoricalAge'], as_index=False).mean())

  CategoricalAge  Survived
0  (-0.08, 16.0]  0.508929
1   (16.0, 32.0]  0.343318
2   (32.0, 48.0]  0.396226
3   (48.0, 64.0]  0.434783
4   (64.0, 80.0]  0.090909

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if sys.path[0] == '':

In [12]:
# Menggunakan kolom name untuk menemukan title (gelar)
import re
def get_title(name):
	title_search = re.search(' ([A-Za-z]+)\.', name)
	# If the title exists, extract and return it.
	if title_search:
		return title_search.group(1)
	return ""

for i in full_data:
    i['Title'] = i['Name'].apply(get_title)

print(pd.crosstab(df['Title'], df['Sex']))

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [13]:
# Mengelompokkan title yang sedikit orangnya menjadi satu kategori rare
for i in full_data:
  # Mengganti title yang sedikit orangnya menjadi rare
  i['Title'] = i['Title'].replace(['Lady', 'Countess','Capt', 'Col',
                                   'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

  # Mengganti title yang tidak sesuai standar penamaan
  i['Title'] = i['Title'].replace('Mlle', 'Miss')
  i['Title'] = i['Title'].replace('Ms', 'Miss')
  i['Title'] = i['Title'].replace('Mme', 'Mrs')

print (df[['Title', 'Survived']].groupby(['Title'], as_index=False).mean())

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

Membersihkan Data

In [14]:
# Menghapus kolom yang tidak digunakan
drop_elements = ['PassengerId', 'Name', 'Ticket', 'Cabin', 'SibSp',\
'Parch', 'FamilySize']
df = df.drop(drop_elements, axis = 1)
df = df.drop(['CategoricalAge', 'CategoricalFare'], axis = 1)

df_test  = df_test.drop(drop_elements, axis = 1)

print (df.head())

train = df.values
test  = df_test.values

   Survived  Pclass     Sex  Age     Fare Embarked  IsAlone Title
0         0       3    male   22   7.2500        S        0    Mr
1         1       1  female   38  71.2833        C        0   Mrs
2         1       3  female   26   7.9250        S        1  Miss
3         1       1  female   35  53.1000        S        0   Mrs
4         0       3    male   35   8.0500        S        1    Mr

In [15]:

# Melakukan mapping terhadap data train
# Mapping Sex
df['Sex'] = df['Sex'].map( {'female': 0, 'male': 1} ).astype(int)
  
# Mapping titles
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
df['Title'] = df['Title'].map(title_mapping)
df['Title'] = df['Title'].fillna(0)

# Mapping Embarked
df['Embarked'] = df['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)
  
# Mapping Age
df.loc[ df['Age'] <= 16, 'Age'] = 0
df.loc[(df['Age'] > 16) & (df['Age'] <= 32), 'Age'] = 1
df.loc[(df['Age'] > 32) & (df['Age'] <= 48), 'Age'] = 2
df.loc[(df['Age'] > 48) & (df['Age'] <= 64), 'Age'] = 3
df.loc[ df['Age'] > 64, 'Age'] = 4

# Mapping Fare
df.loc[ df['Fare'] <= 7.91, 'Fare'] = 0
df.loc[(df['Fare'] > 7.91) & (df['Fare'] <= 14.454), 'Fare'] = 1
df.loc[(df['Fare'] > 14.454) & (df['Fare'] <= 31), 'Fare'] = 2
df.loc[ df['Fare'] > 31, 'Fare'] = 3
df['Fare'] = df['Fare'].astype(int)

In [16]:

# Mapping Sex
df_test['Sex'] = df_test['Sex'].map( {'female': 0, 'male': 1} ).astype(int)
  
# Mapping titles
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
df_test['Title'] = df_test['Title'].map(title_mapping)
df_test['Title'] = df_test['Title'].fillna(0)

# Mapping Embarked
df_test['Embarked'] = df_test['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)
  
# Mapping Age
df_test.loc[ df_test['Age'] <= 16, 'Age'] = 0
df_test.loc[(df_test['Age'] > 16) & (df_test['Age'] <= 32), 'Age'] = 1
df_test.loc[(df_test['Age'] > 32) & (df_test['Age'] <= 48), 'Age'] = 2
df_test.loc[(df_test['Age'] > 48) & (df_test['Age'] <= 64), 'Age'] = 3
df_test.loc[ df_test['Age'] > 64, 'Age'] = 4

# Mapping Fare
df_test.fillna(method='ffill', inplace=True)
df_test.loc[ df_test['Fare'] <= 7.91, 'Fare'] = 0
df_test.loc[(df_test['Fare'] > 7.91) & (df_test['Fare'] <= 14.454), 'Fare'] = 1
df_test.loc[(df_test['Fare'] > 14.454) & (df_test['Fare'] <= 31), 'Fare'] = 2
df_test.loc[ df_test['Fare'] > 31, 'Fare'] = 3
df_test['Fare'] = df_test['Fare'].astype(int)

In [17]:
# Melakukan cek kembali untuk tipe data pada data latih dan data test
display(df.info())
display(df_test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       891 non-null    int64
 4   Fare      891 non-null    int64
 5   Embarked  891 non-null    int64
 6   IsAlone   891 non-null    int64
 7   Title     891 non-null    int64
dtypes: int64(8)
memory usage: 55.8 KB

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    int64
 2   Age       418 non-null    int64
 3   Fare      418 non-null    int64
 4   Embarked  418 non-null    int64
 5   IsAlone   418 non-null    int64
 6   Title     418 non-null    int64
dtypes: int64(7)
memory usage: 23.0 KB

None

In [18]:
# Import function pada sklearn
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [19]:
# Memisahkan data pada data train menjadi data latih dan data validasi
X = df.drop('Survived', axis=1)
y = df['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, stratify=y)

In [20]:
# Membuat model klasifikasi SVC
clf = SVC(gamma=0.06)
clf.fit(X_train, y_train)
y_pred = clf.predict(X_test)

# Melihat Score dari model
score = accuracy_score(y_pred, y_test)
score

0.7932960893854749

In [21]:
result = clf.predict(df_test)

In [22]:
# Membuat file submission
submit = pd.read_csv('titanic_test.csv')
submission = pd.DataFrame({'PassengerId':submit['PassengerId'],'Survived':result})
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [23]:
# Konversi hasil prediksi menjadi csv
filename = 'Titanic Predictions 2.csv'

submission.to_csv(filename,index=False)

print('Saved file: ' + filename)

Saved file: Titanic Predictions 2.csv